Repository: gerritious/chameleon-system
Catalog: src/CoreBundle/Resources/translations/chameleon_system_sanitycheck.*.xliff
Languages: de

# check.bundles_loaded.directorynotopened
source: Directory could not be opened: %0%
de: Verzeichnis konnte nicht geöffnet werden: %0%

# check.bundles_loaded.notregistered
source: Bundle is not registered: %0%
de: Bundle wurde nicht registriert: %0%

# check.bundles_loaded.ok
source: All bundles are registered.
de: Alle Bundles wurden registriert.

# check.cache.active
source: Cache is active.
de: Cache ist aktiv.

# check.cache.activedev
source: Cache is active. This might be obstructive in development mode.
de: Cache ist aktiv. Das könnte im Development-Modus behindern.

# check.cache.inactivedev
source: Cache is inactive. This is ok in development mode.
de: Cache ist deaktiviert. Das ist im Development-Modus in Ordnung.

# check.cache.notactive
source: Cache is inactive. For better performance please configure caching.
de: Cache ist deaktiviert. Für eine bessere Performance bitte dringend den Cache konfigurieren.

# check.database_utf8check.ok
source: Check of used character set for the database connection was successful.
de: Prüfung des verwendeten Zeichensatzes für die Datenbankverbindung war erfolgreich.

# check.database_utf8check.wrongcharset
source: Wrong Character Set: '%0%' uses Character Set '%1%' instead of 'utf8'
de: Falsches Character Set: '%0%' verwendet Character Set '%1%' anstatt 'utf8'

# check.database_utf8check.wrongcollation
source: Wrong Collation: '%0%' uses Collation '%1%' instead of 'utf8_unicode_ci'
de: Falsche Collation: '%0%' verwendet Collation '%1%' anstatt 'utf8_unicode_ci'

# check.cronjob.toolong
source: Cronjobs have been triggered %0% seconds ago. The threshold is set to %1% seconds.
de: Die Cronjobs wurden zuletzt vor %0% Sekunden ausgeführt. Die Grenze ist bei %1% konfiguriert.

# check.cronjob.ok
source: Cronjobs are being triggered correctly
de: Die Cronjobs werden korrekt ausgeführt.

# check.cronjob.never
source: Cronjobs aren't being triggered.
de: Die Cronjobs werden nicht ausgeführt.

# check.imagemagick.found
source: ImageMagick was found.
de: ImageMagick wurde gefunden.

# check.imagemagick.inactive
source: ImageMagick is deactivated.
de: ImageMagick ist deaktiviert.

# check.imagemagick.notfound
source: ImageMagick was not found and can therefore not be used.
de: ImageMagick wurde nicht gefunden und kann daher nicht ausgeführt werden.

# label.directorieswritable
source: Needed write permissions on directories given.
de: Benötigte Schreibrechte auf Verzeichnisse sind gegeben.

# label.diskspace
source: Enough disk space is available.
de: Es ist genügend Plattenplatz verfügbar.

# label.imagemagickactive
source: ImageMagick is found.
de: ImageMagick wurde gefunden.

# label.phpmodulesloaded
source: All needed PHP modules are loaded.
de: Alle benötigten PHP-Module sind geladen.

# label.supportedphpversion
source: A supported PHP version is used.
de: Eine unterstützte PHP-Version wird verwendet.

# label.databaseutf8
source: The database connection uses UTF-8 encoding.
de: Die Datenbankverbindung verwendet UTF-8-Encoding.

# label.cache
source: The recommended cache settings are set.
de: Die empfohlenen Cache-Einstellungen werden verwendet.

# label.bundlesloaded
source: All Symfony bundles are initialized.
de: Alle Symfony-Bundles sind initialisiert.

# label.sql_strict_mode_disabled
source: MySQL strict mode is deactivated.
de: MySQL-Strict-Mode ist deaktiviert.

# label.cronjobs
source: Cronjobs are being called.
de: Cronjobs werden ausgeführt.

# check.sql_strict.databaseerror
source: Error while accessing the database: %0%
de: Fehler beim Zugriff auf die Datenbank: %0%

# check.sql_strict.ok
source: SQL strict mode setting is ok.
de: SQL-Strict-Mode-Einstellung ist in Ordnung.

# check.sql_strict.mustbestrict
source: SQL strict mode must be turned on. You can activate strict mode in the MySQL configuration (my.cnf/my.ini) by adding e.g. the parameter 'sql-mode="STRICT_TRANS_TABLES"'.
de: SQL-Strict-Mode muss angeschaltet sein. Sie können den strikten Modus in der MySQL-Konfiguration (my.cnf/my.ini) aktivieren indem Sie z.B. den Parameter 'sql-mode="STRICT_TRANS_TABLES"' eintragen.

# check.sql_strict.mustnotbestrict
source: SQL strict mode must not be turned on. You can disable strict mode in the MySQL configuration (my.cnf/my.ini) by adding e.g. the parameter 'sql-mode="NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION"'.
de: SQL-Strict-Mode darf nicht angeschaltet sein. Sie können den strikten Modus in der MySQL-Konfiguration (my.cnf/my.ini) deaktivieren indem Sie z.B. den Parameter 'sql-mode="NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION"' eintragen.
